Revit 2026 API

# HasNoValueFilterRule Class

---

Tests whether an element's parameter doesn't have a value.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBParameterValuePresenceRule Autodesk.Revit.DBHasNoValueFilterRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HasNoValueFilterRule : ParameterValuePresenceRule
```
```vb
Public Class HasNoValueFilterRule
	Inherits ParameterValuePresenceRule
```
```cpp
public ref class HasNoValueFilterRule : public ParameterValuePresenceRule
```
```fsharp
type HasNoValueFilterRule =
    class
        inherit ParameterValuePresenceRule
    end
```

The HasNoValueFilterRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HasNoValueFilterRule | constructs an instance of HasNoValueFilterRule. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule) |
|  | Parameter | The parameter which will be evaluated to pass this rule. (Inherited from ParameterValuePresenceRule) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from FilterRule) |
|  | ElementPasses | Derived classes override this method to implement the test that determines whether the given element passes this rule or not. (Inherited from FilterRule) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRuleParameter | Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter. (Inherited from FilterRule) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace